<pad>	0
<unk>	0
<num>	0
.	1983
the	1511
,	1019
and	874
a	607
i	570
is	522
to	518
was	451
of	353
it	325
for	311
in	301
!	298
food	284
we	244
this	243
but	221
you	206
place	205
not	189
great	189
my	181
good	176
that	175
on	172
with	168
service	160
have	151
are	145
had	138
were	137
at	126
very	120
so	120
restaurant	117
they	113
be	111
all	105
there	102
go	100
)	98
as	91
(	91
if	84
like	79
here	73
would	71
our	70
or	70
one	70
just	69
which	69
best	68
by	68
-	65
back	64
out	60
time	60
from	59
an	59
never	58
your	58
been	58
pizza	58
more	57
it's	57
delicious	56
their	55
get	55
about	54
no	54
when	54
too	51
will	51
me	50
us	49
staff	49
don't	49
can	49
what	49
try	48
really	47
nice	47
always	46
excellent	45
than	44
only	43
sushi	43
even	42
dinner	42
has	41
well	41
went	41
menu	41
wine	39
recommend	38
some	37
eat	36
up	36
make	36
new	35
experience	35
worth	35
restaurants	35
other	35
table	34
wait	34
i've	34
times	33
also	33
better	33
atmosphere	33
prices	33
price	32
love	32
got	32
much	32
who	32
amazing	31
again	31
because	31
night	31
little	31
over	31
order	31
do	31
friendly	30
going	30
fresh	30
most	30
dishes	29
can't	29
made	29
indian	29
special	28
ever	28
?	28
city	28
people	28
highly	28
many	27
fish	26
thai	26
chicken	26
way	26
nothing	25
decor	25
last	25
say	25
drinks	25
she	24
around	24
friends	24
first	24
ordered	24
though	24
small	23
came	23
am	23
tasty	23
two	23
favorite	23
any	22
before	22
every	22
everything	22
bit	22
however	22
bad	22
waiter	22
didn't	22
friend	22
he	22
after	21
rice	21
york	21
different	21
hot	21
asked	20
visit	20
thing	20
its	20
spot	20
attentive	20
i'm	20
enjoy	20
once	20
nyc	20
being	20
sure	20
lot	20
want	20
meal	20
average	19
down	19
feel	19
think	19
pretty	19
japanese	19
could	19
romantic	19
both	19
did	19
list	18
away	18
come	18
roll	18
then	18
perfect	18
dessert	18
how	18
while	18
wonderful	18
such	18
definitely	18
must	18
minutes	18
fun	17
day	17
you're	17
bar	17
wasn't	17
top	17
far	17
take	17
places	17
big	17
years	17
waitress	17
said	17
tried	17
them	16
rude	16
eaten	16
find	16
quite	16
off	16
took	16
fast	16
should	16
dining	16
ok	16
money	16
manhattan	15
dish	15
family	15
know	15
expensive	15
into	15
another	15
side	15
fantastic	15
since	15
recommended	15
else	15
world	14
where	14
next	14
appetizer	14
taste	14
ny	14
la	14
lunch	14
huge	14
warm	14
least	14
sauce	14
birthday	14
rolls	14
actually	14
lobster	14
things	14
manager	14
neighborhood	13
looking	13
live	13
enough	13
quality	13
ambience	13
reasonable	13
cheese	13
still	13
overpriced	13
without	13
village	13
italian	13
keep	13
selection	13
left	13
date	13
boyfriend	13
few	13
same	13
four	12
trip	12
thought	12
ate	12
spicy	12
everyone	12
area	12
evening	12
priced	12
bland	12
cold	12
loved	12
that's	12
appetizers	12
found	12
cheap	12
served	12
anything	12
bagel	12
absolutely	12
although	12
course	12
late	12
give	12
eating	12
street	11
ask	11
her	11
finally	11
rather	11
outside	11
sake	11
tuna	11
check	11
pleasant	11
reviews	11
sometimes	11
horrible	11
yes	11
pay	11
work	11
often	11
salad	11
see	11
bagels	11
husband	11
real	11
wanted	11
tasted	11
overall	11
doesn't	11
beautiful	11
especially	11
salmon	11
brooklyn	10
disappointed	10
need	10
shrimp	10
saturday	10
yet	10
simply	10
value	10
probably	10
cozy	10
week	10
worst	10
someone	10
large	10
sat	10
each	10
part	10
fine	10
return	10
we've	10
cute	10
authentic	10
either	10
room	10
delivery	10
bill	10
his	10
now	10
portions	9
cannot	9
wrong	9
cool	9
home	9
told	9
half	9
deal	9
prepared	9
almost	9
sandwich	9
right	9
wife	9
lived	9
glass	9
flavor	9
prompt	9
west	9
sashimi	9
may	9
--	9
town	9
wish	9
person	9
please	9
reservation	9
felt	9
kind	9
expect	9
location	9
bite	9
makes	9
hour	9
entree	9
drink	9
chinese	9
arrived	8
three	8
pork	8
usually	8
point	8
look	8
upon	8
believe	8
sea	8
might	8
they're	8
gets	8
ingredients	8
crust	8
seafood	8
east	8
inside	8
oily	8
group	8
pricey	8
dumplings	8
piece	8
name	8
garden	8
sitting	8
shabu	8
instead	8
poor	8
these	8
belly	8
does	8
problem	8
several	8
happy	8
called	8
dine	8
less	8
crowded	8
pasta	8
simple	8
review	8
impressed	8
fact	8
meat	8
paid	8
main	8
dogs	8
sweet	7
tiny	7
walked	7
share	7
cooked	7
incredible	7
myself	7
i'll	7
serve	7
wouldn't	7
trying	7
something	7
clean	7
extensive	7
awesome	7
decent	7
water	7
looked	7
slightly	7
couple	7
slow	7
casual	7
view	7
house	7
soup	7
done	7
portion	7
fried	7
totally	7
waited	7
yummy	7
those	7
helpful	7
steak	7
open	7
packed	7
bread	7
i'd	7
fairly	7
extremely	7
wines	7
gem	7
chef	7
full	7
cafe	7
completely	7
through	7
waiters	7
mind	7
write	7
fabulous	7
size	7
high	7
old	7
beef	7
won't	7
seen	7
tables	7
music	7
quick	7
maybe	7
seated	7
dog	7
received	7
empty	6
stuff	6
enjoyed	6
grilled	6
reason	6
hang	6
seemed	6
recently	6
establishment	6
crowd	6
having	6
quiet	6
stumbled	6
terrific	6
meals	6
coming	6
hostess	6
getting	6
toppings	6
expected	6
end	6
choices	6
dry	6
disgusting	6
die	6
matter	6
occasion	6
intimate	6
setting	6
seems	6
visited	6
certainly	6
stop	6
business	6
hand	6
tell	6
including	6
during	6
able	6
sum	6
seating	6
red	6
st	6
party	6
pad	6
cuisine	6
salads	6
regular	6
reservations	6
limited	6
beer	6
above	6
fair	6
skip	6
except	6
cost	6
tea	6
green	6
lamb	6
style	6
twice	6
remember	6
pleasantly	6
surprised	6
terrible	6
spectacular	6
outstanding	6
waiting	6
spinach	6
suan	6
bartender	6
apology	6
–	6
casa	6
femme	6
put	6
korean	6
front	6
previous	5
used	5
complimentary	5
interesting	5
ive	5
replied	5
okay	5
waste	5
across	5
relaxed	5
busy	5
lives	5
gone	5
vegetarian	5
hungry	5
conversation	5
yourself	5
french	5
filling	5
consider	5
hands	5
soggy	5
unless	5
disappointment	5
there's	5
offers	5
sit	5
guests	5
mizu	5
customers	5
bathroom	5
outdoor	5
avenue	5
afternoon	5
professional	5
visiting	5
floor	5
ago	5
spice	5
particularly	5
hidden	5
soon	5
liked	5
chance	5
inexpensive	5
literally	5
guess	5
sense	5
filet	5
girlfriend	5
close	5
plates	5
couldn't	5
anyone	5
needs	5
servers	5
year	5
seem	5
secret	5
bukhara	5
hard	5
decided	5
disappointing	5
mean	5
plate	5
months	5
dim	5
offered	5
mediocre	5
guys	5
creative	5
taiwanese	5
williamsburg	5
run	5
bbq	5
feeling	5
space	5
stomach	5
seasons	5
maggot	5
longer	4
brought	4
noodles	4
saul	4
consistently	4
oysters	4
modern	4
listed	4
tempura	4
along	4
asking	4
notch	4
nearby	4
gave	4
kitchen	4
river	4
offer	4
add	4
cake	4
desserts	4
delivered	4
use	4
fancy	4
specials	4
waitstaff	4
comes	4
you'll	4
incredibly	4
seat	4
chinatown	4
phenomenal	4
located	4
cramped	4
planet	4
variety	4
long	4
begin	4
ordering	4
weren't	4
white	4
nights	4
vibe	4
veal	4
reasonably	4
second	4
$8	4
five	4
delight	4
stay	4
jekyll	4
hyde	4
server	4
potatoes	4
compared	4
thin	4
quickly	4
own	4
sunday	4
truly	4
ave	4
etc	4
considering	4
generally	4
jazz	4
grill	4
upscale	4
walking	4
anniversary	4
surprise	4
interior	4
cream	4
toons	4
extra	4
goat	4
chocolate	4
consistent	4
mine	4
mushroom	4
started	4
relax	4
looks	4
affordable	4
typical	4
start	4
joint	4
somewhere	4
lol	4
itself	4
ambiance	4
bottle	4
bottles	4
tasting	4
entrees	4
mid	4
together	4
owner	4
despite	4
exceptional	4
low	4
rush	4
save	4
heard	4
past	4
park	4
brunch	4
nearly	4
crab	4
dont	4
customer	4
caviar	4
corner	4
barely	4
appetizing	4
mahi	4
mashed	4
slice	4
tasteless	4
says	4
egg	4
scene	4
alone	4
oh	4
head	4
missing	4
penne	4
super	4
him	4
guy	4
spend	4
hours	4
:	4
bark	4
glasses	4
flatbush	4
$500	4
unpleasant	4
hooka	4
"	4
dokebi	4
margherita	4
level	4
requests	3
lousy	3
salty	3
tip	3
smith	3
duck	3
chow	3
oyster	3
glad	3
beat	3
fusion	3
between	3
friday	3
leaves	3
mouth	3
company	3
trust	3
urchin	3
buttery	3
surprisingly	3
midtown	3
prix	3
fixe	3
buffet	3
girlfriends	3
idea	3
bistro	3
impressive	3
shredded	3
overrated	3
knows	3
life	3
drive	3
winter	3
kids	3
weekends	3
hype	3
short	3
read	3
taken	3
care	3
block	3
isn't	3
tired	3
finish	3
rushed	3
fix	3
patsy's	3
reviewer	3
we're	3
ravioli	3
anywhere	3
exactly	3
star	3
missed	3
thank	3
moved	3
toilet	3
mess	3
whole	3
watching	3
feet	3
line	3
mozzarella	3
frozen	3
pie	3
uws	3
relaxing	3
theater	3
1st	3
original	3
lovers	3
uni	3
fatty	3
blue	3
filled	3
hall	3
noisy	3
fill	3
noticed	3
true	3
pub	3
enjoying	3
smile	3
type	3
likes	3
guest	3
entertainment	3
dissappointed	3
bart's	3
morning	3
chips	3
refreshing	3
complain	3
vacation	3
range	3
event	3
wong	3
doing	3
congee	3
popular	3
accomodating	3
lovely	3
subtle	3
delightful	3
impeccable	3
rest	3
superb	3
dark	3
noodle	3
nicest	3
claimed	3
celebrate	3
weird	3
describe	3
speaks	3
saw	3
takes	3
1/2	3
ahead	3
cash	3
memorable	3
six	3
crispy	3
cheeses	3
agree	3
feels	3
entire	3
stars	3
vegetables	3
noise	3
paris	3
planning	3
paying	3
bass	3
near	3
awsome	3
eggs	3
blocks	3
later	3
include	3
pita	3
early	3
scallops	3
knew	3
following	3
$10	3
become	3
set	3
calamari	3
spoke	3
thursday	3
patio	3
apart	3
personal	3
unique	3
ice	3
rare	3
choice	3
banana	3
charge	3
personally	3
warn	3
means	3
spreads	3
beverage	3
complete	3
awful	3
seasoning	3
reliable	3
flavors	3
gorgeous	3
free	3
juice	3
imagine	3
you'd	3
daring	3
steamed	3
buns	3
walk	3
management	3
opinion	3
treated	3
ignore	3
holiday	3
leave	3
definately	3
summer	3
likely	3
comment	3
thanks	3
fan	3
sooo	3
gross	3
pastas	3
attractive	3
sadly	3
lacking	3
per	3
kept	3
tapas	3
arrogant	3
2nd	3
attitude	3
under	3
eggplant	3
help	3
upset	3
water's	3
edge	3
yamato	3
word	3
wedding	3
dancers	3
pacifico	3
gyro	3
courses	3
show	3
worked	3
lack	3
farm	3
somewhat	3
clearly	3
environment	3
kobe	3
inedible	3
squid	3
black	3
don’t	3
ignored	2
complained	2
avoid	2
outrageously	2
values	2
requested	2
greasy	2
loud	2
bringing	2
closing	2
o	2
ended	2
perfection	2
eyes	2
hate	2
doubt	2
edamame	2
innovative	2
could've	2
salt	2
tho	2
ceiling	2
effort	2
sleek	2
haru's	2
door	2
difference	2
request	2
rock	2
died	2
judge	2
besides	2
convenience	2
happen	2
e	2
bored	2
rose	2
melted	2
fishy	2
creamy	2
thinking	2
further	2
lanterna	2
stepping	2
quantity	2
heartily	2
chennai	2
frankly	2
compare	2
comparison	2
lava	2
parisian	2
certain	2
brilliant	2
reading	2
fully	2
pastrami	2
jersey	2
amazed	2
leon	2
basic	2
fare	2
nevertheless	2
whom	2
failed	2
everytime	2
decide	2
offensive	2
understand	2
valentines	2
trouble	2
somehow	2
forget	2
$20	2
patient	2
magnificent	2
thailand	2
greatest	2
section	2
terrace	2
charm	2
response	2
baked	2
experiences	2
reviewers	2
repeat	2
mom	2
maitre	2
d'	2
chef's	2
beautifully	2
presented	2
beers	2
orders	2
tons	2
shows	2
courteous	2
we'll	2
common	2
sticks	2
grew	2
walk-up	2
fridays	2
l	2
happens	2
let	2
heaven	2
overlooked	2
became	2
teriyaki	2
$35	2
traditional	2
square	2
depending	2
arrive	2
boths	2
eye	2
move	2
upper	2
miss	2
homemade	2
ourselves	2
soft	2
knowledge	2
cause	2
scallion	2
below	2
expert	2
unbelievable	2
husbands	2
quaint	2
lettuce	2
organic	2
plus	2
$2	2
efficiently	2
friend's	2
tiramisu	2
we'd	2
co-workers	2
luck	2
garlic	2
mention	2
mignon	2
italy	2
ones	2
forward	2
sharing	2
speak	2
traffic	2
working	2
mare	2
pizzeria	2
owners	2
ashamed	2
returning	2
s	2
elegant	2
present	2
bisque	2
maine	2
divine	2
already	2
earlier	2
volare	2
class	2
occassion	2
dress	2
prixe	2
recommendations	2
aware	2
lemon	2
bone	2
difficult	2
anytime	2
disney	2
friendliest	2
enjoyable	2
important	2
growing	2
ess-a-bagel	2
resturant	2
shabu-shabu	2
japan	2
yon	2
yuka	2
office	2
satisfied	2
moderate	2
whether	2
porcini	2
balsamic	2
vinegar	2
emilio	2
school	2
forever	2
bella	2
month	2
basically	2
it;	2
selections	2
dal	2
rocks	2
restraunt	2
yrs	2
opening	2
haven't	2
stale	2
honestly	2
why	2
soy	2
wont	2
offering	2
esp	2
nasty	2
forgot	2
plastic	2
hummus	2
platter	2
sandwiches	2
uncomfortable	2
wooden	2
sizes	2
appropriate	2
host	2
meeting	2
general	2
spaghetti	2
$24	2
picked	2
card	2
sort	2
foods	2
concern	2
broke	2
shanghai	2
bargain	2
asparagus	2
oil	2
seasonal	2
freindly	2
noir	2
incompetent	2
allowed	2
tips	2
pass	2
charming	2
weeks	2
similar	2
mcdonald's	2
poorly	2
wonderful;	2
weather	2
stressed	2
patrons	2
comfortable	2
wants	2
lets	2
change	2
hear	2
surprising	2
cheesecake	2
son	2
bun	2
burgers	2
fell	2
finishing	2
$15	2
$14	2
pound	2
elsewhere	2
forgotten	2
fries	2
martinis	2
comfort	2
sausages	2
freshest	2
introduced	2
4th	2
included:	2
points	2
promptly	2
others	2
folks	2
pizzas	2
immediately	2
total	2
leaving	2
standing	2
rushing	2
serving	2
devoured	2
cakes	2
counter	2
anybody	2
unattractive	2
seriously	2
alot	2
available	2
murray's	2
plan	2
hits	2
doughy	2
excuse	2
dollar	2
moving	2
crew	2
mom's	2
touch	2
lucky	2
strike	2
aesthetic	2
mussels	2
tomato	2
homey	2
in-house	2
dj	2
turnip	2
roast	2
custards	2
mott	2
south	2
passing	2
suprised	2
choose	2
braised	2
toast	2
ride	2
gives	2
clams	2
octopus	2
shared	2
tender	2
happening	2
potato	2
bother	2
third	2
easily	2
otherwise	2
trendy	2
bring	2
queens	2
among	2
plentiful	2
wow	2
eater	2
impress	2
gigantic	2
exceeded	2
expectations	2
hearing	2
pieces	2
classic	2
bloom's	2
sauces	2
expecting	2
bigger	2
design	2
mussles	2
desert	2
rich	2
mint	2
till	2
roti	2
spices	2
onions	2
rao's	2
nobu	2
lasagna	2
pudding	2
weekend	2
unfriendly	2
making	2
preparing	2
perhaps	2
minus	2
relatively	2
pick	2
cheaper	2
personality	2
soho	2
spent	2
downside	2
major	2
hey	2
light	2
vodka	2
al	2
di	2
cypriot	2
souvlaki	2
inviting	2
looove	2
$60	2
beyond	2
views	2
alla	2
perfectly	2
settle	2
dragon	2
joints	2
slope	2
unassuming	2
dancing	2
margaritas	2
celebrated	2
raymond	2
astoria	2
wasted	2
booths	2
occasional	2
mother	2
horrid	2
towels	2
pear	2
variations	2
hope	2
attention	2
future	2
private	2
crazy	2
chilli	2
finished	2
comp	2
reputation	2
hair	2
fiance	2
delivers	2
mirrors	2
$55	2
speechless	2
majorly	2
survives	2
telling	2
travel	2
vanison	2
bison	2
covered	2
offended	2
costly	2
ushered	2
carte	2
fixed	2
possible	2
abused	2
larger	2
appeared	2
taking	2
suggest	2
$	2
given	2
online	2
tonight	2
disgusted	2
accompanied	2
skin	2
jump	2
situation	2
tent	2
included	2
garbage	2
bibimbap	2
nakgi-bokum	2
stone	2
bowl	2
issues	2
brasserie	2
you’re	2
can’t	2
adn	2
prefer	2
tacos	2
stairs	2
mirrored	2
walls	2
rudeness	2
glance	2
farms	2
until	2
undercooked	2
switch	2
shocked	2
twenty	2
refused	2
bfc	2
girl	2
turning	2
display	2
bag	2
clear	2
judging	1
posts	1
noon	1
acted	1
imposing	1
repeated	1
sugar	1
threw	1
confit	1
foie	1
gras	1
terrine	1
figs	1
cart	1
attendant	1
lotus	1
leaf	1
wrapped	1
dry;	1
shu	1
mai	1
i/we	1
binge	1
devine	1
sensual	1
understated	1
breast	1
promising	1
'give	1
'	1
moderately	1
puree	1
pureed	1
anyways	1
tamari	1
vent	1
un-appetizing	1
kills	1
overflowing	1
what's	1
purple	1
haze	1
unusually	1
9:30	1
th	1
pink	1
pony	1
food-awesome	1
service-	1
ambiance-	1
stylish	1
prima	1
facie	1
literate	1
heart	1
handful	1
sheer	1
policy	1
goes	1
self-respect	1
includes	1
letting	1
intimidate	1
trivialities	1
showing	1
vintage	1
tee	1
shirt	1
agenda	1
seeking	1
hmmm	1
tend	1
heavenly	1
consistency-not	1
adequately	1
proportioned	1
ration	1
good--they	1
overpack	1
advanatage	1
woman	1
met	1
touristy	1
truth	1
attracted	1
dressed	1
impecable	1
hunted	1
hideously	1
shot	1
haven	1
tranquility	1
unimposing	1
notorious	1
penny	1
$6	1
continually	1
refilled	1
versus	1
mcds	1
shops	1
somosas	1
chai	1
chole	1
dhosas	1
dhal	1
kinda	1
dissapointing	1
varys	1
day-	1
specify	1
spicy-	1
23rd	1
bday	1
you've	1
weehawken	1
chart	1
beginning	1
step	1
cosette	1
miraculously	1
off-the-beaten	1
path	1
flair	1
above-average;	1
onion	1
overly	1
companion	1
partly	1
strips	1
minnow	1
ever-changing	1
surprises	1
combination	1
super-fresh	1
unusual	1
ridiculous	1
delis	1
deli	1
native	1
tristate	1
signs	1
menus	1
one-hour	1
gem:	1
hip	1
lively	1
young	1
trained	1
story	1
weather;	1
dozens	1
teenage	1
ues	1
angry	1
zucchero	1
pomodori	1
double	1
partial	1
gnocchi	1
refuse	1
parties	1
ino	1
worried	1
managed	1
atmoshpere	1
$3	1
watery	1
shorter	1
gari	1
hit	1
suppose	1
dinosaur	1
hurley's	1
cheers	1
crunchy	1
opened	1
over-bearing	1
tartare	1
bet	1
admittedly	1
gigondas	1
champagne	1
additional	1
tastes	1
freshly	1
parmigana	1
vt's	1
lonk	1
dined	1
provides	1
overcharged	1
scallop	1
moules	1
mother's	1
reserved	1
stepped	1
foot	1
reached	1
adjust	1
lighting	1
plain	1
welll	1
specials--	1
thats	1
downstairs	1
lounge	1
attraction	1
raga's	1
exotic	1
combinations	1
stocked	1
introducing	1
practically	1
cancel	1
dropped	1
silverware	1
boyfriend's	1
jacket	1
apologize	1
clothes	1
medicore	1
grat	1
everythig	1
it-especially	1
actors	1
wasabe	1
sidewalk	1
6th	1
wins	1
hands-down	1
frequently	1
pizzaria's	1
complaints-	1
stinks	1
blantently	1
unappreciative	1
create	1
recent	1
accidently	1
pulitzer	1
prize	1
winning	1
play	1
accompaniment	1
pot	1
excpetiona	1
cheeseburger	1
delictable	1
wan	1
district	1
oasis	1
mid-town	1
nonsense	1
options	1
rule	1
upstate	1
buy	1
freeze	1
store	1
serious	1
closer	1
action	1
recommends	1
aside	1
assortment	1
yellow	1
tail	1
boton	1
fin	1
torro	1
eel	1
instantly	1
orsay	1
non-intrusive	1
budget	1
roasted	1
fat	1
melt-in-your-mouth	1
wine-by-the-glass	1
generously	1
decour	1
raise	1
voices	1
maintain	1
5-8	1
union	1
up:	1
varies	1
mediorce	1
get;	1
ocasionally	1
wondered	1
freshmess	1
raw	1
vegatables	1
vibrant	1
eye-pleasing	1
semi-private	1
band	1
cobb	1
genuinely	1
diamond	1
rough	1
balance	1
herbs	1
tomatoes	1
place's	1
bathrooms	1
laugh	1
scared	1
entertained	1
thougt	1
thier	1
pumkin	1
tortelini	1
advice	1
greenewich	1
disapointed	1
fluffy	1
workers	1
load	1
messy	1
frist	1
delicous	1
mayo;	1
santa	1
fe	1
chopped	1
basement	1
overhyped	1
okay-i	1
pancakes	1
ordinary	1
boring	1
#1	1
penang	1
hats	1
experienced	1
pam's	1
lots	1
medium	1
walnuts	1
costs	1
turn	1
inside-out	1
triples	1
yellowtail	1
$18	1
ups	1
$3-6	1
takeout	1
tupperware	1
reccomendation	1
caesar	1
arugula	1
opted	1
timely	1
concluded	1
depends	1
means:	1
bustling	1
patis	1
wrong;	1
haut	1
hints	1
whatever	1
but:	1
cassuolet	1
steake	1
fritte	1
tripe	1
stew	1
etc;	1
evaluated	1
terms	1
pastis	1
burnt	1
panchetta	1
raddichio	1
bitter	1
sangria	1
muggy	1
fit	1
boston	1
emma's	1
kendall	1
cambridge	1
funky	1
bombay	1
tikka-masala	1
naan	1
mmmmm	1
chelsea	1
mad	1
hanger	1
rubber	1
flavorless	1
thawed	1
hipsters	1
apparently	1
writing	1
defiantly	1
warehouse	1
amazingly	1
thumbs	1
ambient	1
dare	1
asian	1
onto	1
hopping	1
excellent-the	1
too--but	1
backyard	1
ny--i	1
rivals	1
country	1
cover	1
snowy	1
*not*	1
citysearch's	1
editorial	1
editor's	1
romance	1
louder	1
57th	1
crammed	1
$70+	1
$30+	1
category	1
instance	1
dumped	1
handed	1
upside	1
constant	1
mille	1
grazie	1
constitute	1
proper	1
redeeming	1
factor	1
deficiencies	1
teodora	1
anticipating	1
edible	1
and/or	1
rosemary	1
orange	1
flavoring	1
overdone	1
expresso	1
myagi	1
city;	1
negative	1
sound	1
tartar	1
fornino's	1
blows	1
families	1
receipies	1
curtious	1
p	1
gimmicks	1
freshness	1
preparation	1
quietly	1
shout	1
unobtrusive	1
attend	1
yorkers	1
clubhouse	1
breathtaking	1
wonderfull	1
oz	1
england	1
chowder	1
award	1
mash	1
melts	1
prime	1
rib	1
bubbly	1
weekday	1
korbett	1
cuz	1
excuses	1
wks	1
stopped	1
ranting	1
raving	1
vindaloo	1
starter	1
favourite	1
suits	1
gowns	1
shirts	1
jeans	1
cater	1
allergies	1
required	1
amex	1
exception	1
pepper	1
watering	1
counted	1
branzino	1
infused	1
diner-ish	1
sparse	1
prune	1
plans	1
afortune	1
build	1
kinds	1
effects	1
tradional	1
characters	1
jeckll	1
hydes	1
t	1
sigh	1
iced	1
whenever	1
sty-town	1
enormous	1
lox	1
unappealing	1
zero	1
boot	1
try-state	1
thius	1
loves	1
tokyo	1
adds	1
ultra	1
art	1
taxan	1
arigato	1
gozimas	1
local	1
curry	1
molto	1
bene	1
trattoria	1
menu-fare	1
parmesean	1
souffle	1
glazed	1
surely	1
transported	1
northern	1
closely	1
situated	1
candle-light	1
food-quality	1
overcompensate	1
guaranteeed	1
known	1
godfather	1
continued	1
gods	1
mortal	1
marinara/arrabiatta	1
en	1
carozza	1
mmmmmmmm	1
meets	1
pray	1
stays	1
ciao	1
wonderfully	1
cheesesticks	1
pepperoni	1
yum	1
lie	1
quater	1
amma	1
chefs	1
tamarind	1
par	1
non-veg	1
spotty	1
importantly	1
student	1
nyu	1
dam	1
kababs	1
flyer	1
yonkers	1
banquet	1
parsipanny	1
locations	1
haru	1
rated	1
all-u-can-eat	1
no-so-fresh	1
thinly-sliced	1
fall-apart	1
u	1
sodium	1
vinegar-soaked	1
waitstaffs	1
roth's	1
boarderline	1
wouldnt	1
benedict	1
removing	1
hollondaise	1
svc	1
w/the	1
forks	1
nearing	1
$7	1
saves	1
desk	1
amazin	1
vegetarian;	1
whatsoever	1
seats	1
against	1
wall	1
benches	1
closes	1
patroon	1
features	1
cigar	1
associates	1
lloovve	1
mermaid	1
inn	1
outing	1
fallback	1
warrant	1
randomly	1
recommendation	1
halibut	1
top-notch	1
candle	1
gift	1
mark	1
based	1
unhappy	1
using	1
msg	1
cooking	1
customer's	1
health	1
fool	1
bo	1
jelly	1
drunken	1
soupy	1
stir	1
fry	1
cares	1
frequented	1
'ino	1
remains	1
varied	1
bruschettas	1
paninis	1
tramezzinis	1
palate	1
stagnating	1
truffle	1
parmesan	1
bruschetta	1
winner	1
over-priced	1
hesititate	1
self	1
european	1
jsut	1
evil	1
concerned	1
waitressing	1
grabbed	1
him:	1
america	1
stormed	1
teareyed	1
yelling	1
survive	1
model/waitress	1
unprofessional	1
current	1
thick	1
thrilled	1
thirty	1
gentleman	1
greeting	1
differently	1
understandable	1
indeed	1
uncourteous	1
downright	1
lit	1
ear	1
institutions	1
runned	1
operation	1
seattle	1
8:30	1
mileau	1
casimir	1
snag	1
unisex	1
cleaned	1
hospitable	1
royalty	1
russe	1
grade	1
owned	1
hoboken	1
referred	1
particulary	1
mojito	1
settled	1
utsav	1
yr	1
calm	1
colleague	1
pastries	1
roxy's	1
cheeseburgers	1
consequently	1
did'nt	1
pastrami-but	1
taste-i've	1
trendi	1
soo	1
tom	1
kha	1
pathetic	1
thoroughly	1
pesto	1
thin-crust	1
amount	1
conveniently	1
bedford	1
herb	1
definetly	1
exclaimed	1
helps	1
unpretensious	1
sardines	1
biscuits	1
pistachio	1
atlantic	1
streets	1
joya	1
fastest	1
particular	1
ceviche	1
mix	1
assorted	1
types	1
favorites	1
abrupt	1
stand	1
ofr	1
greeted	1
cordial	1
suggesting	1
helped	1
gulab	1
jamun	1
thanked	1
whim	1
someplace	1
guacamole+shrimp	1
frites	1
neither	1
cared	1
tomorrow	1
;-	1
dates	1
reluctant	1
jem	1
overcrowded	1
jus	1
praise	1
lazy	1
alphabet	1
items	1
ten	1
agreed	1
explored	1
sophia	1
vow	1
outta	1
hurry	1
unnecessary	1
roxy	1
final	1
judgement	1
blond	1
wood	1
soothing	1
premium	1
japenese	1
grammercy	1
warning:	1
thalia	1
match	1
smoked	1
roe	1
inspired	1
strawberry	1
daiquiries	1
battery	1
taiwan	1
saffron	1
risotto-yum	1
potatos	1
basil	1
calzones	1
horrific	1
vomit-inducing	1
yuck	1
smell	1
canned	1
calzone	1
dosas	1
skimpy	1
drip	1
grease	1
popcorn	1
topping	1
calling	1
hampton	1
chutney	1
co	1
substance	1
unhelpful	1
clerks	1
dearth	1
former	1
kicks	1
ass	1
unheralded	1
impecible	1
magnificant	1
impossible	1
peaceful	1
lawns	1
hudson	1
statue	1
liberty	1
out-of-towners	1
sunset	1
apppetizers	1
sushimi	1
cucumber	1
complaint:	1
toasting	1
lightly	1
toasted	1
murray	1
directory	1
fooled	1
crowds	1
sudden	1
crave	1
neightborhood	1
proprietor	1
rarity	1
ess-a	1
tal	1
scoop	1
diet	1
coffee	1
faced	1
turkey	1
scary	1
encountered	1
udon	1
badly	1
furthermore	1
adequate	1
inexpertly	1
sliced	1
obvious	1
jimmys	1
domincan	1
exprience	1
jimmy	1
dominican	1
ghetto	1
funny	1
blasted	1
system	1
isnt	1
minimun	1
latin	1
quarters	1
closed	1
sally	1
margheritta	1
atmoshere	1
winnie	1
sample	1
discreet	1
robust	1
brioche	1
lollies	1
favors	1
saving	1
refleshment	1
snacks	1
chat	1
retired	1
hipster	1
degree	1
certainty	1
laid-back	1
beautification	1
she's-way-cuter-than-me-that-b@#$*	1
cooked-to-perfection	1
shoestring	1
ls	1
delightfully	1
bts	1
delish	1
martini	1
vanilla	1
shanty	1
mmmm	1
lady	1
moreover	1
classmates	1
hutner	1
college	1
students	1
coconut	1
pongsri	1
48th	1
summer-eat	1
feature	1
friendlier	1
changed	1
inconsistent	1
icecream	1
hamburgers	1
rip-off	1
patties	1
standards	1
raucous	1
gig	1
alternative	1
tips:	1
corner:	1
kiosk	1
bayard	1
bakery	1
canal	1
sometime	1
consisted	1
standard	1
brassiere	1
balthazar	1
shank	1
se	1
ew	1
ginger	1
understands	1
grand	1
regret	1
chosing	1
hostile	1
nobody	1
firm	1
answers	1
responsibility	1
deserves	1
shut-down	1
fails	1
oven	1
drawback	1
forgivable	1
annoying	1
celebrities	1
sweat	1
parts	1
yawn	1
wonder	1
whats	1
rao	1
correct	1
eats	1
amanzing	1
inovated	1
cheff	1
confortable	1
frendly	1
overcooked	1
'special'	1
shop	1
old-fashioned	1
zabars	1
barney	1
greengrass	1
bought	1
drawbacks:	1
downtown	1
fix:	1
suggestion	1
kanish	1
servings	1
wasnt	1
joke	1
virgins	1
weekly	1
regulars	1
regard	1
enormous;	1
single-handedly	1
solved	1
famine	1
anti-pasta	1
mains	1
hike	1
quibbles	1
off-set	1
pour-your-own	1
measures	1
liquers	1
courtesey	1
decorative	1
grab	1
yeah	1
shouldn't	1
wannabes	1
pre-theatre	1
after-theatre	1
guaranteed	1
togethers	1
heartland	1
brewery	1
gimmick	1
theme	1
hundreds	1
scampi	1
antipasti	1
venture	1
island	1
corona	1
wipe	1
chin	1
atomosphere	1
milan	1
heritage	1
tagliatelle	1
dissapointment	1
icing	1
cake:	1
resembled	1
mascarpone	1
chips-good	1
cry	1
implies	1
intermediate	1
ribs	1
varieties	1
porridge	1
congestion	1
hand-painted	1
ahhh	1
rate	1
cheescake	1
warmer	1
selecion	1
dissapoints	1
daily	1
basis	1
casserole	1
sapphire	1
stick	1
works	1
reuben	1
manhatten	1
ottimo	1
fresca	1
setting/atmosphere	1
lowered	1
draw	1
pakistani	1
straight	1
faan	1
aweful	1
picky	1
fishiest	1
seabass	1
w/	1
bones	1
recomend	1
couples	1
jukebox	1
plays	1
opera	1
strokes	1
they'd	1
8pm	1
usha	1
fav	1
sassy	1
lassi	1
unda	1
delicate	1
kick-ass	1
redone	1
food's	1
spots	1
split	1
5th	1
drumsticks	1
sour	1
keeps	1
roommate	1
yorkie	1
indoor	1
amid	1
chic	1
10-piece	1
combo	1
$1	1
footing	1
crabmeat	1
earth	1
caters	1
apps	1
test	1
palets	1
obviously	1
translation	1
prosperity	1
cantonese	1
broth	1
slices	1
donut	1
deep	1
dough	1
call	1
ow	1
ley	1
soh	1
kettle	1
piping	1
labor	1
whoever	1
duo	1
speedy	1
wherever	1
owns	1
typhoon	1
marks	1
good;	1
meet	1
yakitori	1
meats	1
attached	1
angel's	1
pre-sliced	1
miserable	1
obligated	1
watched	1
accidentally	1
drop	1
unagi	1
retrieving	1
proceed	1
queens'	1
biggest	1
cheaply-priced	1
manhattanite	1
soho/village/upper	1
pretentious	1
clientele	1
roosevelt	1
spilled	1
shooed	1
snobby	1
lip	1
absurdly	1
wait-staff	1
recognize	1
glorified	1
diner	1
clumsy	1
bgel	1
overated	1
shoppe	1
74th	1
fellas	1
flushing	1
baluchi's	1
solid	1
subpar	1
appears	1
postal	1
moment	1
nigiri	1
stuffing	1
beaten	1
areo	1
mostly	1
older	1
groups	1
20's/30	1
olds	1
girls	1
skiline	1
foggy	1
rainy	1
recommand	1
requesting	1
window	1
questions	1
gruppo	1
pans	1
dramatic	1
huffing	1
panting	1
muttering	1
breath	1
b/c	1
walkup	1
$2+	1
ain't	1
off-	1
character	1
fortunate	1
wise	1
tremendously	1
bucket	1
heaviness	1
someting	1
undermine	1
task	1
diggest	1
count	1
moody	1
afterwards	1
stuffed	1
rosa	1
waltzes	1
stopping	1
recieved	1
exemplifies	1
artsy	1
blew	1
uppereast	1
mocaramel's	1
compelled	1
respond	1
vittorio	1
family--although	1
not-so-little	1
he's	1
not-so-frequent	1
visitor	1
additions	1
years:	1
lasagnas	1
girlfiends	1
g	1
disapointing	1
dumpling	1
luckily	1
saved	1
tipsy	1
risottos	1
sepia	1
rabbit	1
overpriced-	1
conscious	1
eco	1
discovered	1
half/half	1
buffalo	1
m	1
comeback	1
alice	1
wonderland	1
3-4	1
10%	1
fresher	1
kiku	1
comparable	1
ruined	1
millennium	1
code	1
food:	1
sold	1
richly	1
rewarded	1
savor	1
indo-chinese	1
negatives	1
bestt	1
cant	1
alright	1
im	1
necessarily	1
fanatical	1
pirces	1
restaraunt	1
smiling	1
welcome	1
vitello	1
marsala	1
mushrooms	1
balls	1
immature	1
didnt	1
specific	1
slowwwww	1
waitresses	1
flirting	1
men	1
werent	1
1/26	1
pimentos	1
luke	1
"the	1
seasons"	1
arm	1
leg	1
romatic	1
$400	1
swept	1
dynamite	1
otherworldly	1
'best'	1
bond	1
jewelbako	1
unpretentious	1
effective	1
serves	1
inventive	1
millenium	1
musts	1
wow-	1
quesadilla	1
three-year	1
proportion	1
$11	1
guacamole	1
tequila	1
scandalous	1
crappy	1
attracts	1
crowds--this	1
million	1
9/10	1
reviews--i	1
duty	1
spread	1
reccomended	1
eatting	1
sign	1
engagement	1
organized	1
brunch/lunch	1
honored	1
voss	1
remind	1
survice	1
mmmmmmmmmmmmmmm	1
designed	1
dreamy	1
egyptian	1
sceney	1
watch	1
talented	1
baba	1
ganoush	1
lemony	1
smoky	1
hookah	1
casually	1
omlette	1
quacamole	1
wings	1
chimmichuri	1
weakness	1
portobello	1
mole	1
upgraded	1
gyros	1
bright	1
bz	1
stands	1
usual	1
shine	1
aggressively	1
seasoned	1
cyrpriot	1
higher	1
various	1
greek	1
come--if	1
act	1
blowing	1
nathan's	1
mall	1
playing	1
allow	1
eachother	1
'that'	1
99%	1
exceptions	1
too-authentic-for-me	1
beware	1
ther	1
daughter's	1
reception	1
highest	1
compliments	1
raved	1
rooms	1
incomparable	1
cheerfully	1
cooperative	1
paul	1
ruth	1
bride	1
filthy	1
eh	1
tilapia	1
cardboard	1
$170	1
speaking	1
mens	1
wet	1
trash	1
n	1
soap	1
cubano	1
edgewater	1
nj	1
pool	1
pre-theater	1
modified	1
$65	1
pp	1
knowledgeable	1
pairings	1
"free"	1
olives	1
torte	1
unable	1
provide	1
suggestions	1
inquired	1
ports	1
prestige	1
pays	1
details	1
great:it's	1
button	1
understood	1
exceeds	1
actual	1
prob	1
dinning	1
atleast	1
greg	1
humor	1
professionalism	1
respects	1
privacy	1
runner	1
remembers	1
job	1
steal	1
board	1
bev	1
force	1
model	1
endless	1
trimmings	1
peppers	1
relish	1
ages	1
favor	1
unlike	1
hospitality	1
cocktail	1
citrus	1
lime	1
prepare	1
drawn	1
captivated	1
sites	1
def	1
commending	1
wanting	1
bottom	1
showed	1
smilingly	1
apologized	1
comped	1
politely	1
willing	1
sick	1
concession	1
arguing	1
cook	1
intelligent	1
entry	1
haute	1
barnyard	1
sweepstakes	1
league	1
hills	1
adderlys	1
albeit	1
dismal	1
unhygienic	1
2times	1
flavorful	1
sit-in	1
pleased	1
youre	1
doesnt	1
triple	1
color	1
norwegetan	1
mazing	1
tries	1
scheme	1
lost	1
confusing	1
go-to	1
foreseeable	1
pre-fix	1
$29/per	1
indo	1
lollipop	1
espeically	1
originally	1
attended	1
form	1
presentation	1
stunned	1
swaying	1
bronx	1
=	1
bf	1
juicy	1
plenty	1
crunch	1
snap	1
munchies	1
boost	1
strikes	1
credit	1
living	1
explore	1
underground	1
accident	1
bunch	1
face	1
tab	1
places:	1
"expensive-but-worth-it"	1
"expensive-and-wtf"	1
twenty-something	1
laying	1
$300	1
occassions	1
freaking	1
kidding	1
argue	1
classy	1
target	1
uber	1
whealthy	1
joe	1
drinks:	1
dom	1
perignon	1
starters:	1
wagyu	1
caliber	1
advertise	1
consomme	1
entrees:	1
dessert:	1
pure	1
disaster	1
pineapple	1
glaze	1
tart	1
history	1
landmark	1
nose	1
"i've	1
restaurant"	1
curiousity	1
dearly	1
dessserts	1
trophy	1
wives	1
escorts	1
scammers	1
necessary	1
diners	1
birthdays	1
10-15	1
momentarily	1
arrival	1
excited	1
indicating	1
pushed	1
accept	1
minute	1
beverages	1
sides	1
admitted	1
lumps	1
spitting	1
napkin	1
nor	1
trapped	1
receive	1
dirty	1
dancer	1
danced	1
wallets	1
empy	1
stomachs	1
supposed	1
acceptable	1
fought	1
earned	1
sons	1
intended	1
drove	1
terribly	1
refunded	1
approximately	1
6:20	1
"wow	1
aren't	1
together"	1
"no	1
aback	1
hastily	1
descriptions	1
tap	1
bottled	1
brahma	1
knuckles	1
"salt	1
encrusted	1
shrimp"	1
round	1
brahma's	1
stall	1
sixth	1
member	1
"well	1
convenient	1
brother	1
seemingly	1
drenched	1
grapfruit	1
continue	1
sister	1
fork	1
"large	1
party"	1
50th	1
regularly	1
"normal	1
food"	1
tikka	1
masala	1
$25	1
push	1
appreciate	1
patron's	1
turnoff	1
tagline	1
"indian	1
rave"	1
gf	1
deff	1
wretched	1
retching	1
starters	1
else's	1
predictably	1
thinks	1
passes	1
option	1
kimchee	1
random	1
slimy	1
complaints	1
hence	1
reviewing	1
heads	1
cleanliness	1
prep	1
stations	1
sanity	1
sent	1
lying	1
age	1
fifteen	1
minimal	1
amend	1
none	1
hung	1
passed	1
doubled	1
aggressive	1
equally	1
causing	1
throw	1
remainder	1
informed	1
blacklisted	1
culinary	1
lover	1
bragging	1
repulsive	1
risk	1
ideal	1
book	1
organza	1
dosut	1
sizzling	1
stir-fried	1
passable	1
refill	1
mentioned	1
nodded	1
communications	1
english	1
acknowledgment	1
touched	1
charged	1
ware	1
32nd	1
risotto	1
ink	1
turns	1
lips	1
teeth	1
farro	1
yukon	1
quintessential	1
chew	1
acidity	1
heightens	1
components	1
possibly	1
undoubtedly	1
adventure	1
enter	1
unmarked	1
doors	1
zen	1
décor	1
you’ll	1
ground	1
ceilings	1
sky	1
it’s	1
‘excuse	1
me’	1
opens	1
curtain	1
booth	1
bbe	1
$29	1
flight	1
sakes	1
lately	1
experimenting	1
acquiring	1
amuse	1
bouche	1
yuzu	1
cod	1
commented	1
miso	1
sake’s	1
complimented	1
successfully	1
easing	1
sesame	1
mousse	1
extraordinary	1
matcha	1
powdered	1
blueberry	1
philly	1
i’ll	1
zenkichi	1
unhurried	1
compliment	1
desired	1
celebrtating	1
pricce	1
monring	1
ad	1
apologizing	1
handing	1
honest	1
compares	1
tatsu	1
kimchi	1
one-two	1
punch	1
twists	1
croquette	1
supermarket	1
squishy	1
fathers	1
fall	1
dizzy	1
delusional	1
concept	1
newly	1
created	1
comforting	1
uncooked	1
spanish	1
creation	1
misstake	1
cramp	1
coworker	1
improved	1
regardless	1
advantage	1
dumbfoundingly	1
mind-bogglingly	1
lexicographers	1
note:	1
fascinating	1
definition	1
alive	1
flourishing	1
appear	1
perfected	1
ghastly	1
technique	1
guilty	1
deigning	1
attract	1
polite	1
acknowledgement	1
out;	1
supercilious	1
scorn	1
aligned	1
napkins	1
inspect	1
vapidly	1
plonk	1
venturing	1
rent	1
enhanced	1
dumping	1
halfway	1
hasn't	1
cooling	1
fit-out	1
furnishings	1
des	1
vins	1
$120	1
represents	1
passive-aggressive	1
torture	1
scale	1
world-beater	1
palce	1
avid	1
goers	1
lookout	1
appalled	1
bed	1
de-skinned	1
asks	1
bbqs	1
report	1
"oh	1
earlier"	1
explode	1
bad:	1
anymore	1
preposterous	1
fired	1
cirspy	1
alked	1
offerd	1
imazingly	1
loaded:	1
positives	1
mw	1
single	1
positives:	1
middle	1
eastern	1
chuckie	1
cheeze	1
results	1
citysearch	1
thread	1
stock	1
positive	1
hide	1
god	1
distraction	1
notice	1
payed	1
bucks	1
frickin	1
competitive	1
market	1
economy	1
slamwich	1
train	1
tongue	1
complaint	1
pricing--i	1
item	1
nonetheless--great	1
occasions	1
greet	1
hideous	1
frizzy	1
retro	1
winged/	1
dame	1
edna	1
yell	1
amused	1
9pm	1
"had	1
to"	1
wtf	1
horrified	1
rudely	1
5'6"	1
brown	1
eavesdrops	1
chimes	1
hears	1
uninvited	1
opinions	1
context	1
*really*	1
talking	1
gotten	1
employee	1
who's	1
maitre-d-"eat	1
out"	1
maitre-d	1
unwelcoming	1
high-end	1
son's	1
joined	1
followed	1
shortly	1
behavior	1
frontman	1
smug	1
condescending	1
deportment	1
wise:	1
disturb	1
maitre-d's	1
turnover"	1
whacked	1
off-night	1
father	1
flank	1
swordfish	1
elevated	1
numerous	1
needed	1
fire	1
ads	1
heat	1
throughout	1
45mins	1
explanation	1
handled	1
threatened	1
meager	1
discount	1
complaining	1
disrespectful	1
clients	1
hassle	1
justifies	1
accolades	1
receives	1
skipped	1
mistakes	1
grunt	1
hoops	1
via	1
jwils	1
100%	1
distinct	1
disappeared	1
insane	1
"can	1
you"	1
"how	1
indication	1
unfortunately	1
shame	1
non-existent	1
tag	1
teamed	1
holding	1
delivering	1
began	1
pet	1
peeve	1
everywhere	1
reach	1
occupied	1
retrain	1
